package evt.co.il.nomorepain;

import android.annotation.SuppressLint;
import android.app.Dialog;
import android.content.Intent;
import android.content.SharedPreferences;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.view.View;
import android.webkit.WebView;
import android.widget.Button;
import android.widget.SeekBar;
import android.widget.TextView;

public class ResultsActivity extends AppCompatActivity {

    TextView tvR;
    String theResult,theResultnow,link =  "https://www.youtube.com/embed/0SianznASOc";
    Boolean btnPic = false; //if the user arrived this screen from the pic in mainActivity called true
    SharedPreferences prefs;
    int stepTip ,levelSeek = 0  ; //the step of the result
    Button btnNextResult,btnCancel;
    WebView wbr;
    SeekBar seek;
    int iArea;
    int rt; // the num of the result

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_results);




        initlayout();

       initevent();
    }



    private void initevent() {


        btnNextResult.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {

                levelSeek ++;

                if(levelSeek<4) {


                    seek.setProgress(levelSeek);

                    SharedPreferences.Editor editor = getSharedPreferences("igal", MODE_PRIVATE).edit();
                    editor.putInt("level",levelSeek );

                    editor.apply();

                    invid();
                }else{

                    levelSeek=0;
                    SharedPreferences.Editor editor = getSharedPreferences("igal", MODE_PRIVATE).edit();
                    editor.putInt("level",levelSeek );

                    editor.apply();
                    seek.setProgress(levelSeek);
                    invid();
                }

                SharedPreferences.Editor editor = getSharedPreferences("igal", MODE_PRIVATE).edit();
                editor.putInt("step",stepTip );

                editor.apply();


            }
        });


        btnCancel.setOnClickListener(new View.OnClickListener() {
            @SuppressLint("SetTextI18n")
            @Override
            public void onClick(View v) {

                SharedPreferences.Editor editor = getSharedPreferences("igal", MODE_PRIVATE).edit();
                editor.putString("totalresult","a" );

                editor.apply();

                Dialog dialog = new Dialog(ResultsActivity.this);
                dialog.setContentView(R.layout.layoutmassage);
                TextView txt = (TextView)dialog.findViewById(R.id.tvMsg);

                Button btnmsg = (Button)dialog.findViewById(R.id.btnMsg);

                txt.setText("משתמש יקר!\n" +

                        "חשוב לדעת ששיטת האבחון בשאלון מבוססת על ביצוע חזרות מרובות של תנועה ולפעמים 10 חזרות לא מספיקות על מנת להחליט האם התנועה מחמירה/מקלה/לא משנה את הכאבים. אם במהלך השאלון הרגשת שהיו לך שאלות כאלו, יש לבצע את התנועה הספציפית במשך 2-3 ימים, 10 חזרות בכל 2-3 שעות, ולאחר מכן לענות שוב על השאלון.");

                btnmsg.setText("למסך ההתחלה");

                btnmsg.setOnClickListener(new View.OnClickListener() {
                    @Override
                    public void onClick(View v) {


                         Intent intent  = new Intent(ResultsActivity.this,MainActivity.class);
                         startActivity(intent);

                    }
                });

                dialog.show();

               // Intent intent  = new Intent(ResultsActivity.this,MainActivity.class);
               // startActivity(intent);
            }
        });
    }





    private void invid() {

       // if (iArea==5000) {

            switch (rt) {

                case 1:


                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/1RFrLHa5id8";

                            tvR.setText("יש לנו איבחון ,כנראה שהכאבים שלך נובעים כתוצאה ממנחי יציבה לא נכונים ישיבה,עמידה או שכיבה.\n\nהפיתרון המתאים: למידה ותירגול בשמירה על מנחי גוף תקינים.\n\nתרגול: יש לשבת ללא משענת עם מקסימום פשיטהבגב התחתון ( ראה תמונה ).\nשחרר מעט למשך 5 שניות  ואז שחרר לגמרי את הפשיטה ( ראה תמונה ).\nיש לבצע 10-15 חזרות כאשר בחזרה האחרונה יש לנסות להחזיק דקה שלמה (במקום 5 שניות)\nתרגול זה מומלץ לבצע 1-3 פעמים ביום\n\n* עם התרגול עלולים להופיע כאבים חדשים שיעלמו עם הזמן.\n\n* יש להימנע ככל הניתן מתנוחות לא נכונות של הגוף לאורך זמן כגון: ישיבה כפופה, עמידה שפופה וכו.\n\nצפי לשיפור: תרגול של מספר שבועות והימנעות מתנוחות לא נכונות לאורך זמן.\nלאחר שתורגש הקלה יש לעבור לתירגול הבא.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/6ggpXZzkXM0";
                            tvR.setText("בנוסף לתרגול של תיקון לישיבה נכונה, חשוב לעשות תרגילי חיזוק. \nנא" +
                                    "לשכב על הגב, ידיים מורמות כלפי התקרה והברכיים כפופות (כפות הרגליים על" +
                                    "המיטה- ראה דוגמא). \nנא לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם" +
                                    "הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 1-2 שניות. \nיש לבצע 10 חזרות, 3" +
                                    "סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/vG8kS5-B68Q";
                            tvR.setText("התקדמות בתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים" +
                                    "מורמות כלפי התקרה והברכיים כפופות )כפות הרגליים על המיטה(. נא להרים רגל" +
                                    "אחת ישרה באוויר ואז לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר)\n עם" +
                                    "הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן" +
                                    "יציב למרות הרמת הרגל- ראה דוגמא).\nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום.\n\n" +
                                    "כאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText("התקדמות בתרגילי חיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי.\nנא להרים יד אחת" +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן)\nולהישאר" +
                                    "סטטיים כ- 10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה" +
                                    "דוגמא). \nיש לבצע 10 חזרות בכל צד, 3-2 סטים, פעם אחת ביום. ");
                            break;
                        default:
                            link = "https://www.youtube.com/watch?v=1RFrLHa5id8";

                    }

                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 2:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/cn6W4Eh8zak";
                            //https://www.youtube.com/embed/cn6W4Eh8zak
                            tvR.setText("יש לנו איבחון נראה כי כאבי הגב שלך נובעים מהעמסה על ריקמה כגון צלקת פנימית קודמת , דלקות חוזרות וכו או כאבי גב חוזרים \n\nפיתרון: שיפור גמישות הרקמות באיזור עמוד השידרה הקידמי ע״י תרגול מתיחות במהלך היום במקרא שלך הכיוון המועדף הוא הזדקפות הגו (פשיטה) \n\n תרגול: בעמידה ידיים מונחות על הגב התחתון להקשית את הגב לאחור תוך שמירה על ברכיים ישרות או בשכיבה על הבטן כפות ידיים מתחת לכתפיים ולבצע הקשתה  \n\nלבצע את התרגול 10-15 חזרות בכל 3 שעות במהלך היום \n\nבמקרא שאין הקלה משמעותית או ישנה החמרה  יש לענות על השאלון מחדש או להיוועץ עם רופא מומחה \n\nצפי לשיפור: מספר שבועות בהנחה שיש תרגול עיקבי \n\nאמצעי זהירות: את החזרות הראשונות מומלץ לבצע בעדינות ");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/4GWcqH44Qhs";
                            tvR.setText(" התקדמות העומסים על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על" +
                                    "אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא).\nיש " +
                                    "לבצע את התרגיל בהתחלה בטווח בינוני עד הפקת מתיחה/כאב. \nחשוב לבצע את התרגיל -10 " +
                                    "15 חזרות, בכל 3 שעות במהלך היום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור " +
                                    "לתרגיל הבא.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות העומסים על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב " +
                                    "התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את " +
                                    "התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \nחשוב לבצע את התרגיל " +
                                    "15-10 חזרות, בכל 3 שעות במהלך היום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור " +
                                    "לתרגיל הבא.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" תוספת תרגיל חיזוק למרכז הגוף. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. נא להרים יד " +
                                    "אחת לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים " +
                                    "כ- 15-10 שניות\n (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא).\nיש לבצע 10 " +
                                    "חזרות בכל צד, 3-2 סטים, פעם אחת ביום. ");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/cn6W4Eh8zak";

                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 3:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/watch?v=iN6kMFsRXug";
                            tvR.setText("יש לנו איבחון נראה כי הכאב נגרם מהצתלקות מסויימת של מערכת העצבים הגורמת להקרנת כאב אל הרגל, ומחמירה לרוב בהליכה ( בעיקר בצעדים גדולים ) או ישיבה עם ברכיים ישרות \n\nפתרון:שיפור גמישות הרקמה העצבית במקרא שלך הכיוון המועדף הוא כיפוף לפנים \n\nתרגול: שכיבה על הגב ברכיים כפופות למשוך את הברכיים לכיוון החזה ומייד לאחר מכן לבצע כיפוף לפנים בישיבה \n\nצפי לשיפור: מספר שבועות בהנחה שתרגול עיקבי ועלייה תווח בהדרגתיות \n\nאמצעי זהירות: לבצע את החזרות הראשונות של הכיפוף הערנות ובאיטיות  ");

                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/wDC4qFjtYBc";
                            tvR.setText("התקדמות במתיחה של מערכת העצבים. \n\nבישיבה בקצה הכיסא, נא להתכופף לפנים עד " +
                                    "הרגשת מתח/כאב ברגל ובסוף הכיפוף להוסיף לחץ על ידי משיכת הגוף למטה יותר בעזרת הידיים על השוקיים (ראה דוגמא).\nחשוב לבצע את התרגיל 5-10 חזרות, בכל 3 שעות במהלך היום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/0TTKziv3UIN4";
                            tvR.setText(" התקדמות במתיחה " +
                                    "של מערכת העצבים. \n\nבישיבה בקצה הכיסא, נא להזיז רגל אחת (הכואבת) לפנים ואז להתכופף  לפנים עד הרגשת מתח/כאב ברגל ובסוף הכיפוף להוסיף לחץ על ידי משיכת הגוף למטה יותר בעזרת הידיים על השוקיים (ראה דוגמא). \nחשוב לבצע את התרגיל 5-10 חזרות, בכל 3 שעות במהלך היום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/xF2IVR9NGyw";
                            tvR.setText("התקדמות במתיחה של מערכת העצבים. \n\nבעמידה עם הידיים על הירכיים, נא להתכופף " +
                                    "לפנים עד הרגשת מתיחה/כאב ברגל ולחזור חזרה למעלה (ראה דוגמא). \nחשוב לבצע את  התרגיל 5-10 חזרות, בכל 3 שעות במהלך היום. \nבכל פעם שמסיימים סט, יש לבצע פשיטת גב לאחור בעמידה. ");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/iN6kMFsRXug";

                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;
                case 4:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/iN6kMFsRXug";
                            tvR.setText("יש לנו איבחון נראה כי הכאב נגרם מהעמסה על ריקמה כגון: צלקת פנימית , דלקות קודמות או כאבים חוזרים   \n\nפתרון:שיפור גמישות הרקמות בחלק האחורי של עמוד השידרה המותני \n\nתרגול: שכיבה על הגב ברכיים כפופות למשוך את הברכיים לכיוון החזה עד הפקת מתיחה או כאב בגב ואז שיחרור \n\nצפי לשיפור: מספר שבועות בהנחה שתרגול עיקבי ועלייה תווח בהדרגתיות \n\nאמצעי זהירות: לבצע את החזרות הראשונות של הכיפוף הערנות ובאיטיות ולנסות להגיע לסוף התווח ");


                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/xF2IVR9NGyw";
                            tvR.setText(" התקדמות במתיחת עמוד השדרה. \n\nבעמידה עם הידיים על הירכיים, נא להתכופף לפנים עד " +
                                    "הרגשת מתיחה/כאב ברגל ולחזור חזרה למעלה (ראה דוגמא). \n\nחשוב לבצע את התרגיל 5-10  חזרות, בכל 3 שעות במהלך היום. \nבכל פעם שמסיימים סט, יש לבצע פשיטת גב לאחור בעמידה. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/vG8kS5-B68Q";
                            tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה " +
                                    "והברכיים כפופות (כפות הרגליים על המיטה). \nנא להרים רגל אחת ישרה באוויר ואז לבצע  הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות \n(יש לשמור על אגן יציב למרות הרמת הרגל- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "￼￼￼￼￼￼￼￼￼￼￼" +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום. ");

                            break;
                        default:
                            link = "https://www.youtube.com/embed/Ov1R1qVGzzk";

                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 5:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/iN6kMFsRXug";
//iN6kMFsRXug
                            tvR.setText("יש לנו איבחון נראה כי הכאב אצלך נובע כנראה מהפרעה תוך מפרקית,הגורמת לשינוי במנח הטיבעי של המפרק במנוחה \n\nפתרון: מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה נורמאלית שלו ככל שחוזרים עליה, במקרא שלך הכיוון המועדף הוא כיפוף לפנים.   \n\nתירגול:ברכיים כפופות בשכיבה על הגב נא להביא את הברכיים לכיוון בית החזה בעזרת הידיים ולשחרר (ראה סרטון), יש לבצע 10 חזרות כל שעתיים שלוש, כשמרגישים שהתנועה כבר אינה משפיעה לגב יש להתקדם לתרגול הבא  \n\nאמצעי זהירות: לבצע את החזרות הראשונות לאט \n\nיש להרגיש כי בכאב נעלם או מוקל בזמן התרגול עובר למרכז הגב ואז נעלם");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/xF2IVR9NGyw";
                            tvR.setText(" התקדמות במתיחת עמוד השדרה. \n\nבעמידה עם הידיים על הירכיים, נא להתכופף לפנים עד " +
                                    "הרגשת מתיחה/כאב ברגל ולחזור חזרה למעלה (ראה דוגמא). \n\nחשוב לבצע את התרגיל 5-10  חזרות, בכל 3 שעות במהלך היום. \nבכל פעם שמסיימים סט, יש לבצע פשיטת גב לאחור בעמידה. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/vG8kS5-B68Q";
                            tvR.setText("התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה " +
                                    "והברכיים כפופות (כפות הרגליים על המיטה). \nנא להרים רגל אחת ישרה באוויר ואז לבצע  הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן יציב למרות הרמת הרגל- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא. ");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי, נא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \n\nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/iN6kMFsRXug";
                            tvR.setText(" ");

                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;
                case 33:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/2_huSL4-T00";
                            tvR.setText("יש לנו איבחון נראה כי הכאב אצלך נובע כנראה מהפרעה תוך מפרקית,הגורמת לשינוי במנח הטיבעי של המפרק במנוחה \n\nפתרון: מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה נורמאלית שלו ככל שחוזרים עליה, במקרא שלך הכיוון המועדף הוא כיפוף לפנים.   \n\nתירגול: ישיבה בקצה כסא ידיים בין הרגליים, נא לבצע כיפוף לפנים כאשר הידיים נינוחות לכיוון הריצפה (ראה סרטון), יש לבצע 10 חזרות כל שעתיים שלוש, כשמרגישים שהתנועה כבר אינה משפיעה לגב יש להתקדם לתרגול הבא  \n\nאמצעי זהירות: לבצע את החזרות הראשונות לאט  \n\nיש להרגיש כי בכאב נעלם או מוקל בזמן התרגול עובר למרכז הגב ואז נעלם");

                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/iN6kMFsRXug";
                            tvR.setText(" התקדמות בהעמסה " +
                                    "על עמוד השדרה. \n\nבשכיבה על הגב, ברכיים כפופות. \nלהביא את הברכיים לכיוון החזה בעזרת הידיים ולשחרר. \nיש לבצע 10 חזרות, בכל 2-3 שעות (ראה דוגמא). \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/xF2IVR9NGyw";
                            tvR.setText(" התקדמות במתיחת עמוד השדרה. \nבעמידה עם הידיים על הירכיים, נא להתכופף לפנים עד " +
                                    "הרגשת מתיחה/כאב ברגל ולחזור חזרה למעלה (ראה דוגמא). \n\nחשוב לבצע את התרגיל 5-10  חזרות, בכל 3 שעות במהלך היום. \nבכל פעם שמסיימים סט, יש לבצע פשיטת גב לאחור בעמידה. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות לתרגילי חיזוק. \nבעמידת 6 על המיטה, גב במצב ניטרלי. נא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ-  10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/2_huSL4-T00";
                            tvR.setText(" ");

                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 6:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/6e3lupJZlf8";
                            tvR.setText("יש לנו איבחון נראה כי הכאב אצלך נובע כנראה מהפרעה תוך מפרקית,הגורמת לשינוי במנח הטיבעי של המפרק במנוחה \n\nפתרון: מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה נורמאלית שלו ככל שחוזרים עליה, במקרא שלך הכיוון המועדף הוא הזדקפות הגוו (פשיטה).   \n\nתירגול: שכיבה על הבטן עם ידיים לצידי הגוף וראש מוטה לאחד הצדדים, פיסוק קל בין הרגליים ידיים מתחת לכתפיים ולהתרומם עם פלג הגוף העליון בעזרת הידיים בלבד (ראה סרטון), \n\nחשוב לבצע 10-15 חזרות כל שעתיים שלוש, \n\n חשוב!! במידה וישנה הקרנה לאיזור הישבן או הרגליים  לשים לב כי הכאב הולך ועובר עם התירגול או עובר רק לאיזור הגב. כשמרגישים שהתנועה כבר אינה משפיעה לגב יש להתקדם לתרגול הבא  \n\nאמצעי זהירות: לבצע את החזרות הראשונות לאט.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/5brCfMDk_d0";
                            tvR.setText("התקדמות " +
                                    "בהעמסה על עמוד השדרה. \n\nנא לשכב על הבטן עם ידיים מתחת לכתפיים. \nלדחוף למעלה את פלג הגוף העליון בעזרת הידיים בלבד, תוך כדי שחרור של שרירי הרגליים/ישבן/גב תחתון (ראה דוגמא). \nיש לבצע את התרגיל בהתחלה בזהירות בטווחים בינוניים עד הרגשת מתח/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/cn6W4Eh8zak";
                            tvR.setText(" התקדמות " +
                                    "בהעמסה על עמוד השדרה. \n\nנא לשכב על הבטן עם ידיים מתחת לכתפיים. \nלדחוף למעלה את פלג הגוף העליון בעזרת הידיים בלבד, תוך כדי שחרור של שרירי הרגליים/ישבן/גב תחתון (ראה דוגמא). \nיש לבצע את התרגיל כך שמנסים להגיע לטווחים המקסימאליים עם החזרות עד למצב שהמרפקים מתיישרים. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText(" התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText(" ");

                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 7:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/7iNIJapYo24";
                            tvR.setText("יש לנו איבחון " +
                                    "ככל הנראה הכאבים שלך נובעים מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו מפריעה ומגבילה את תנועת המפרק. \n\nפתרון- מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה הנורמאלית שלו ככל שחוזרים עליה. \nבמקרה שלך, הכיוון המועדף הוא לצד. \n\nתרגול- בעמידה עם הכתף אל הקיר (הצד הלא כאוב אל הקיר), רגליים צמודות ונמצאות במרחק כ- 30 ס\"מ מהקיר. יד נגדית נמצאת על המותן ודוחפת את האגן לכיוון הקיר (ראה דוגמא). \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה.\n\n" +
                                    "* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. קיצור רקמות וכאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");

                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/cn6W4Eh8zak";//cn6W4Eh8zak
                            tvR.setText(" התקדמות " +
                                    "בהעמסה על עמוד השדרה. \n\nנא לשכב על הבטן עם ידיים מתחת לכתפיים. \nלדחוף " +
                                    "למעלה את פלג הגוף העליון בעזרת הידיים בלבד (תוך כדי הוצאת אוויר), תוך כדי " +
                                    "￼￼￼￼￼￼￼￼￼￼" +
                                    "שחרור של שרירי הרגליים/ישבן/גב תחתון (ראה דוגמא). \nיש לבצע את התרגיל כך שמנסים להגיע לטווחים המקסימאליים עם החזרות עד למצב שהמרפקים מתיישרים. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText(" התקדמות " +
                                    "העומסים על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. " +
                                    "נא להרים יד אחת לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל  הזמן) ולהישאר סטטיים כ- 10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" ");

                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 32:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/39dWr_IGGeY";
                            tvR.setText(
                                    "יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח  המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו מפריעה ומגבילה את תנועת המפרק. \n\nפתרון- מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה הנורמאלית שלו ככל שחוזרים עליה. \nבמקרה שלך, הכיוון המועדף הוא לצידי + פשיטה לאחור. \n\nתרגול- בעמידה עם הכתף אל הקיר (הצד הלא כאוב אל הקיר), רגליים צמודות ונמצאות במרחק כ- 30 ס\"מ מהקיר. \nיד נגדית נמצאת על המותן ודוחפת את האגן לכיוון הקיר. \nבסוף התנועה, להצמיד את הרגל הקרובה אל הקיר ולהוסיף תנועת פשיטת גוו לאחור (ראה דוגמא). \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, \n\nחשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- במהלך התרגיל יש לנסות להגיע לסוף הטווח של התנועה הצידית (אגן אל הקיר) ורק אז להוסיף בעדינות את תנועת הפשיטה לאחור (בהתחלה בעדינות ועם החזרות לנסות להגיע לסוף טווח הפשיטה\n\n)." +
                                            "* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. בקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");

                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות " +
                                    "העומסים על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות  הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים " +
                                    "ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות " +
                                    "כלפי התקרה והברכיים כפופות (כפות הרגליים על המיטה). \nנא להרים רגל אחת ישרה  באוויר ואז לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן יציב למרות הרמת הרגל- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/vG8kS5-B68Q";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי." +
                                    "נא להרים יד אחת לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל " +
                                    " הזמן) ולהישאר סטטיים כ- 10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא).\nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" ");

                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 8:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/q_h22wwW5Tg";

                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח " +
                                    "המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו מפריעה ומגבילה את תנועת המפרק. \n\nפתרון- מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה הנורמאלית שלו ככל שחוזרים עליה. \nבמקרה שלך, הכיוון המועדף הוא פשיטת גוו לאחור בשכיבה, תוך כדי הסטת האגן אל הצד הלא כאוב. \n\nתרגול- בשכיבה על הבטן, נא להישען על האמות, להרים את האגן ולהסיט אותו אל הצד הלא כאוב. \nהעבר את כפות הידיים מתחת לכתפיים וממנח זה לדחוף את פלג הגוף העליון למעלה בעזרת הידיים בלבד (ראה דוגמא). \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה. \n\n* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה." +

                                    "בקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");

                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/xyU_ta6JjEU";
                            tvR.setText("התקדמות " +
                                    "בהעמסה על עמוד השדרה. \n\nנא לשכב על הבטן עם ידיים מתחת לכתפיים. \nלדחוף למעלה את  פלג הגוף העליון בעזרת הידיים בלבד (תוך כדי הוצאת אוויר), תוך כדי שחרור של שרירי הרגליים/ישבן/גב תחתון (ראה דוגמא). \nיש לבצע את התרגיל כך שמנסים להגיע לטווחים המקסימאליים עם החזרות עד למצב שהמרפקים מתיישרים. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");


                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. חשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");


                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \n\nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");


                            break;
                        default:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" ");


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 9:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/svwOni3H_Dw";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו מפריעה ומגבילה את תנועת המפרק. \n\nפתרון- מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה הנורמאלית שלו ככל " +
                                    "שחוזרים עליה. \nבמקרה שלך, הכיוון המועדף הוא רוטציה לכיוון הצד הכאוב תוך כדי שהברכיים והירכיים כפופות.\n\n" +
                                    "תרגול- נא לשכב על הגב כאשר הידיים לצידי הגוף, רגליים כפופות. \nלהביא את הברכיים אל כיוון החזה ולסובב את הברכיים אל הצד הכאוב, מבלי לשחרר את כיפוף הברכיים אל החזה (ראה דוגמא). \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, \n\nחשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל.\n\n" +
                                    "* אמצעי זהירות- במהלך התרגיל יש לנסות להגיע לסוף טווח הכיפוף לפני שמתחילים את הרוטציה.\n\n" +
                                    "* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. \nברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");


                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/IKItyecTGYA";
                            tvR.setText(" נא לבצע את " +
                                    "אותו התרגיל אך הפעם להוסיף לחץ עם היד הנגדית על הרגל לשם הוספת לחץ בעמוד " +
                                    "השדרה (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");


                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/3NGj3KS_3dI";
                            tvR.setText(" נא לבצע " +
                                    "את אותו התרגיל אך הפעם להוסיף לחץ עם היד הנגדית על הרגל ולהחזיק בסוף הטווח  3-5 שניות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");


                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText(" התקדמות " +
                                    "העומסים על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות  הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים " +
                                    "ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");


                            break;
                        default:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText(" ");


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 10:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/cp_uYjY2Hgs";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו מפריעה ומגבילה את תנועת המפרק. \n\nפתרון- מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה הנורמאלית שלו ככל " +
                                    "שחוזרים עליה. \nבמקרה שלך, הכיוון המועדף הוא רוטציה לכיוון הצד שאינו כאוב תוך כדי שהברכיים והירכיים כפופות.\n\n" +
                                    "תרגול- נא לשכב על הגב כאשר הידיים לצידי הגוף, רגליים כפופות. \nלהביא את הברכיים אל כיוון החזה ולסובב את הברכיים אל הצד הלא כאוב, מבלי לשחרר את כיפוף הברכיים אל החזה (ראה דוגמא). \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, \n\nחשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל.\n\n" +
                                    "* אמצעי זהירות- במהלך התרגיל יש לנסות להגיע לסוף טווח הכיפוף לפני שמתחילים את הרוטציה.\n\n" +
                                    "* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. \nברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");


                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/8wlBeb6Ax94";
                            tvR.setText(" נא לבצע את " +
                                    "אותו התרגיל אך הפעם להוסיף לחץ עם היד הנגדית על הרגל לשם הוספת לחץ בעמוד " +
                                    "השדרה (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");


                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/--orVQOfe6k";
                            tvR.setText(" נא לבצע " +
                                    "את אותו התרגיל אך הפעם להוסיף לחץ עם היד הנגדית על הרגל ולהחזיק בסוף הטווח  3-5 שניות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");


                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText(" התקדמות " +
                                    "העומסים על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות  הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים " +
                                    "ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");


                            break;
                        default:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText(" ");


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 11:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/6e3lupJZlf8";
                            tvR.setText("יש לנו איבחון נראה כי הכאב אצלך נובע כנראה מהפרעה תוך מפרקית,הגורמת לשינוי במנח הטיבעי של המפרק במנוחה \n\nפתרון: מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה נורמאלית שלו ככל שחוזרים עליה, במקרא שלך הכיוון המועדף הוא הזדקפות הגוו (פשיטה).   \n\nתירגול: שכיבה על הבטן עם ידיים לצידי הגוף וראש מוטה לאחד הצדדים יש לשכב בתנוחה זו 1-2 דקות, אז פיסוק קל בין הרגליים ידיים מתחת לכתפיים ולהתרומם עם פלג הגוף העליון בעזרת הידיים בלבד (ראה סרטון), \n\nחשוב לבצע 10-15 חזרות כל שעתיים שלוש, \n\n חשוב!! במידה וישנה הקרנה לאיזור הישבן או הרגליים  לשים לב כי הכאב הולך ועובר עם התירגול או עובר רק לאיזור הגב. כשמרגישים שהתנועה כבר אינה משפיעה לגב יש להתקדם לתרגול הבא  \n\nאמצעי זהירות: לבצע את החזרות הראשונות לאט.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/5brCfMDk_d0";
                            tvR.setText("התקדמות " +
                                    "בהעמסה על עמוד השדרה. \n\nנא לשכב על הבטן עם ידיים מתחת לכתפיים. \nלדחוף למעלה את פלג הגוף העליון בעזרת הידיים בלבד, תוך כדי שחרור של שרירי הרגליים/ישבן/גב תחתון (ראה דוגמא). \nיש לבצע את התרגיל בהתחלה בזהירות בטווחים בינוניים עד הרגשת מתח/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/cn6W4Eh8zak";
                            tvR.setText(" התקדמות " +
                                    "בהעמסה על עמוד השדרה. \n\nנא לשכב על הבטן עם ידיים מתחת לכתפיים. \nלדחוף למעלה את פלג הגוף העליון בעזרת הידיים בלבד, תוך כדי שחרור של שרירי הרגליים/ישבן/גב תחתון (ראה דוגמא). \nיש לבצע את התרגיל כך שמנסים להגיע לטווחים המקסימאליים עם החזרות עד למצב שהמרפקים מתיישרים. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText(" התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText(" ");

                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 12:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/iN6kMFsRXug";
//iN6kMFsRXug
                            tvR.setText("יש לנו איבחון נראה כי הכאב אצלך נובע כנראה מהפרעה תוך מפרקית,הגורמת לשינוי במנח הטיבעי של המפרק במנוחה \n\nפתרון: מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה נורמאלית שלו ככל שחוזרים עליה, במקרא שלך הכיוון המועדף הוא כיפוף לפנים.   \n\nתירגול:ברכיים כפופות בשכיבה על הגב נא להביא את הברכיים לכיוון בית החזה בעזרת הידיים ולשחרר (ראה סרטון), יש לבצע 10 חזרות כל שעתיים שלוש, כשמרגישים שהתנועה כבר אינה משפיעה לגב יש להתקדם לתרגול הבא  \n\nאמצעי זהירות: לבצע את החזרות הראשונות לאט/n/n יש להרגיש כי בכאב נעלם או מוקל בזמן התרגול עובר למרכז הגב ואז נעלם");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/xF2IVR9NGyw";
                            tvR.setText(" התקדמות במתיחת עמוד השדרה. \n\nבעמידה עם הידיים על הירכיים, נא להתכופף לפנים עד " +
                                    "הרגשת מתיחה/כאב ברגל ולחזור חזרה למעלה (ראה דוגמא). \n\nחשוב לבצע את התרגיל 5-10  חזרות, בכל 3 שעות במהלך היום. \nבכל פעם שמסיימים סט, יש לבצע פשיטת גב לאחור בעמידה. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/vG8kS5-B68Q";
                            tvR.setText("התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה " +
                                    "והברכיים כפופות (כפות הרגליים על המיטה). \nנא להרים רגל אחת ישרה באוויר ואז לבצע  הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן יציב למרות הרמת הרגל- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא. ");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי, נא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \n\nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/iN6kMFsRXug";
                            tvR.setText(" ");

                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 13:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו מפריעה ומגבילה את תנועת המפרק. \n\nפתרון- מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה הנורמאלית שלו ככל שחוזרים עליה. \nבמקרה שלך, הכיוון המועדף הוא פשיטת גוו לאחור בעמידה. \n\nתרגול- בעמידה עם ידיים מונחות על הגב התחתון ורגליים בפיסוק ברוחב אגן. \nלהקשית את הגב לאחור כמה שניתן (עד הרגשת ההגבלה אך מבלי להפיק כאב/הקרנה ברגל) (ראה דוגמא). \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה. \n\n* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");


                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/6ggpXZzkXM0";
                            tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה והברכיים כפופות (כפות הרגליים על המיטה). \nנא לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/vG8kS5-B68Q";
                            tvR.setText("התקדמות בתרגילי החיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה " +
                                    "והברכיים כפופות (כפות הרגליים על המיטה). \nנא להרים רגל אחת ישרה באוויר ואז לבצע " +

                                    " הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן יציב למרות הרמת הרגל- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. נא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \n\nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                            break;
                        default:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" ");


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 14:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו מפריעה ומגבילה את תנועת המפרק. \n\nפתרון- מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה הנורמאלית שלו ככל שחוזרים עליה. \nבמקרה שלך, הכיוון המועדף הוא פשיטת גוו לאחור בעמידה,אך בטווח תנועה קטן מבלי להפיק החמרה של הכאב ברגל. \n\nתרגול- בעמידה עם ידיים מונחות על הגב התחתון ורגליים בפיסוק ברוחב אגן. \nלהקשית את הגב לאחור כמה שניתן (עד הרגשת ההגבלה אך מבלי להפיק כאב/הקרנה ברגל) (ראה דוגמא). \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה. \n\n* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");


                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/6ggpXZzkXM0";
                            tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה והברכיים כפופות (כפות הרגליים על המיטה). \nנא לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/vG8kS5-B68Q";
                            tvR.setText("התקדמות בתרגילי החיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה " +
                                    "והברכיים כפופות (כפות הרגליים על המיטה). \nנא להרים רגל אחת ישרה באוויר ואז לבצע " +

                                    " הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן יציב למרות הרמת הרגל- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. נא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \n\nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                            break;
                        default:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" ");


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 15:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/6NsiVzxD0jo";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו מפריעה ומגבילה את תנועת המפרק. \n\nפתרון- מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה הנורמאלית שלו ככל שחוזרים עליה. \nבמקרה שלך, הכיוון המועדף הוא לצד עם הישארות בסוף הטווח. \n\nתרגול- בעמידה עם הכתף אל הקיר (הצד הלא כאוב אל הקיר), רגליים צמודות ונמצאות " +

                                    "במרחק כ- 30 ס\"מ מהקיר. \nיד נגדית נמצאת על המותן ודוחפת את האגן לכיוון הקיר ולהישאר בסוף הטווח 3-5 שניות (ראה דוגמא). \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה. \n\n* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. בקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");


                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב  התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6ggpXZzkXM0";
                            tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה והברכיים כפופות (כפות הרגליים על המיטה). נא לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \n\nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                            break;
                        default:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" ");


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 16:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/6e3lupJZlf8";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו מפריעה ומגבילה את תנועת המפרק. \n\nפתרון- מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה הנורמאלית שלו ככל " +
                                    "שחוזרים עליה. \nבמקרה שלך, הכיוון המועדף הוא פשיטת גוו לאחור בשכיבה על הבטן, מבלי להפיק החמרה של הכאב ברגל. \n\nתרגול- מתחילים עם שכיבה על הבטן עם ידיים לצדי הגוף וראש מוטה לאחר הצדדים. " +
                                    "לשכב בתנוחה זו במשך 1-2 דק', או עד הקלת הכאב עם קיים בזמן השכיבה. \nלאחר מכן לפתוח פיסוק קל בין הרגליים וידיים מתחת לכתפיים. \nלבצע הרמה של פלג הגוף העליון בעזרת הידיים בלבד בטווח קטן (ראה דוגמא). \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה.\n\n" +
                                    "* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. \nברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");


                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/5brCfMDk_d0";
                            tvR.setText("התקדמות " +
                                    "בהעמסה על עמוד השדרה. \n\nנא לשכב על הבטן עם ידיים מתחת לכתפיים. \nלדחוף למעלה את  פלג הגוף העליון בעזרת הידיים בלבד (תוך כדי הוצאת אוויר), תוך כדי שחרור של שרירי הרגליים/ישבן/גב תחתון (ראה דוגמא). \nיש לבצע את התרגיל בהתחלה בזהירות בטווחים בינוניים עד הרגשת מתח/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום. כאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/cn6W4Eh8zak";
                            tvR.setText("התקדמות " +
                                    "בהעמסה על עמוד השדרה. \n\nנא לשכב על הבטן עם ידיים מתחת לכתפיים. \nלדחוף למעלה את פלג הגוף העליון בעזרת הידיים בלבד (תוך כדי הוצאת אוויר), תוך כדי שחרור של שרירי הרגליים/ישבן/גב תחתון (ראה דוגמא). \nיש לבצע את התרגיל כך שמנסים להגיע לטווחים המקסימאליים עם החזרות עד למצב שהמרפקים מתיישרים. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. חשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");


                            break;
                        default:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText(" ");


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 17:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/6e3lupJZlf8";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו מפריעה ומגבילה את תנועת המפרק. \n\nפתרון- מציאת התנועה הנכונה אשר תחזיר את המפרק לתנועה הנורמאלית שלו ככל " +
                                    "שחוזרים עליה. \nבמקרה שלך, הכיוון המועדף הוא פשיטת גוו לאחור בשכיבה על הבטן, אך בטווח תנועה קטן מבלי להפיק החמרה של הכאב ברגל. \n\nתרגול- מתחילים עם שכיבה על הבטן עם ידיים לצדי הגוף וראש מוטה לאחר הצדדים. " +
                                    "לשכב בתנוחה זו במשך 1-2 דק', או עד הקלת הכאב עם קיים בזמן השכיבה. \nלאחר מכן לפתוח פיסוק קל בין הרגליים וידיים מתחת לכתפיים. \nלבצע הרמה של פלג הגוף העליון בעזרת הידיים בלבד בטווח קטן (ראה דוגמא). \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה.\n\n" +
                                    "* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. \nברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");

                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/xyU_ta6JjEU";
                            tvR.setText("התקדמות בהעמסה " +
                                    "על עמוד השדרה. \n\nנא לשכב על הבטן עם ידיים מתחת לכתפיים. \nלדחוף למעלה את פלג הגוף העליון בעזרת הידיים בלבד (תוך כדי הוצאת אוויר), תוך כדי שחרור של שרירי הרגליים/ישבן/גב תחתון (ראה דוגמא). \nיש לבצע את התרגיל כך שמנסים להגיע לטווחים המקסימאליים עם החזרות עד למצב שהמרפקים מתיישרים. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                            break;
                        default:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" ");


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 18:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/IKItyecTGYA";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק.\n\n" +

                                    "פתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בשכיבה על הגב, לכופף את הברכיים אל הבטן ולהביא את הברכיים הצידה לכיוון הצד הכאוב (ראה דוגמא). \nלאחר שיפור בהקרנה לרגל ניתן להתקדם לתרגיל הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם, במיוחד במצבי כאב. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, \n\nחשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה. \n\n* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים " +
                                    "אם אינו מטופל כמה שיותר מהר");


                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6ggpXZzkXM0";
                            tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה והברכיים כפופות (כפות הרגליים על המיטה). נא לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                            break;
                        default:
                            link = "https://www.youtube.com/embed/I_woiNhpreU";
                            tvR.setText(" ");


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 19:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/4x0FK8BC9o4";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק.\n\n" +
                                    "פתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בשכיבה על הגב, לכופף את הברכיים אל הבטן ולהביא את הברכיים הצידה לכיוון הצד הכאוב ולהישאר בסוף הטווח 3-5 שניות מבלי להפיק כאב/הקרנה ברגל (ראה דוגמא). \nלאחר שיפור בהקרנה לרגל ניתן להתקדם לתרגיל הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם, במיוחד במצבי כאב. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה.\n\n" +
                                    "* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. \nברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");

                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6ggpXZzkXM0";
                            tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה והברכיים כפופות (כפות הרגליים על המיטה). נא לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                            break;
                        default:
                            link = "https://www.youtube.com/embed/I_woiNhpreU";
                            tvR.setText(" ");


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 20:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/8wlBeb6Ax94";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק.\n\n" +
                                    "פתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בשכיבה על הגב, לכופף את הברכיים אל הבטן ולהביא את הברכיים הצידה לכיוון הצד הלא כאוב מבלי להפיק כאב/הקרנה ברגל (ראה דוגמא). לאחר שיפור בהקרנה לרגל ניתן להתקדם לתרגיל הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם, במיוחד במצבי כאב. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, \nחשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה.\n\n" +
                                    "* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. \nברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");


                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6ggpXZzkXM0";
                            tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה והברכיים כפופות (כפות הרגליים על המיטה). נא לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                            break;
                        default:
                            link = "https://www.youtube.com/embed/I_woiNhpreU";
                            tvR.setText(" ");


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 21:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/--orVQOfe6k";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק.\n\n" +
                                    "פתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על " +

                                    "העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בשכיבה על הגב, לכופף את הברכיים אל הבטן ולהביא את הברכיים הצידה לכיוון הצד הלא כאוב עם הישארות סטטית בסוף הטווח של 3-5 שניות מבלי להפיק כאב/הקרנה ברגל (ראה דוגמא). \nלאחר שיפור בהקרנה לרגל ניתן להתקדם לתרגיל הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם, במיוחד במצבי כאב. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה. \n\n* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. \nברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");


                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6ggpXZzkXM0";
                            tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה והברכיים כפופות (כפות הרגליים על המיטה). נא לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                            break;
                        default:
                            link = "https://www.youtube.com/embed/I_woiNhpreU";
                            tvR.setText(" ");


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 22:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/cp_uYjY2Hgs";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק.\n\n" +
                                    "פתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בשכיבה על הגב, לכופף את הברכיים אל הבטן ולהביא את הברכיים הצידה לכיוון הצד הלא כאוב אך בטווח קטן יחסית מבלי להפיק כאב/הקרנה ברגל (ראה דוגמא). \nלאחר שיפור בהקרנה לרגל ניתן להתקדם לתרגיל הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם, במיוחד במצבי כאב. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה.\n\n" +
                                    "* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");


                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/--orVQOfe6k";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק.\n\n" +
                                    "פתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על " +

                                    "העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בשכיבה על הגב, לכופף את הברכיים אל הבטן ולהביא את הברכיים הצידה לכיוון הצד הלא כאוב עם הישארות סטטית בסוף הטווח של 3-5 שניות מבלי להפיק כאב/הקרנה ברגל (ראה דוגמא). \nלאחר שיפור בהקרנה לרגל ניתן להתקדם לתרגיל הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם, במיוחד במצבי כאב. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה. \n\n* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. \nברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");


                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                            break;
                        default:
                            link = "https://www.youtube.com/watch?v=I_woiNhpreU";


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 23:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/svwOni3H_Dw";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק.\n\n" +
                                    "פתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בשכיבה על הגב, לכופף את הברכיים אל הבטן ולהביא את הברכיים הצידה לכיוון הצד הכאוב אך בטווח קטן יחסית מבלי להפיק כאב/הקרנה ברגל (ראה דוגמא). \nלאחר שיפור בהקרנה לרגל ניתן להתקדם לתרגיל הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם, במיוחד במצבי כאב. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה.");

                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/4x0FK8BC9o4";
                            tvR.setText("התקדמות " +
                                    "העומסים על עמוד השדרה. \n\nבשכיבה על הגב, לכופף את הברכיים אל הבטן ולהביא את הברכיים הצידה לכיוון הצד הכאוב. \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב ולהישאר סטטי בסוף הטווח 3-5 שניות לשם הגברת אפקט התרגיל, מבלי להפיק כאב/הקרנה ברגל (ראה דוגמא). \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום. \nלאחר שיפור בהקרנה ניתן להתקדם לתרגיל הבא.");

                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                            break;
                        default:
                            link = "https://www.youtube.com/watch?v=I_woiNhpreU";


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 24:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/9ffds0tw0-I";
                            tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי " +
                                    "במנוחה. \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת  האגן ומגבילה את תנועת המפרק. \n\nפתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בעמידה עם היד על המותן הבולטת יותר הצידה ולדחוף את האגן הצידה לשם תיקון סטיית הגוף וחזרה (ראה דוגמא). \nלאחר תיקון הסטייה ניתן לעבור לתרגיל הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה.");


                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6ggpXZzkXM0";
                            tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה והברכיים כפופות (כפות הרגליים על המיטה). נא לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                            break;
                        default:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" ");


                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 25:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/sBUDcY5duwY";
                            tvR.setText("יש לנו איבחון, הכאבים " +
                                    "שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה.  \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק. \n\nפתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בעמידה עם היד על המותן הבולטת יותר הצידה ולדחוף את האגן הצידה בטווח קטן יחסית לשם תיקון סטיית הגוף וחזרה, מבלי להפיק כאב/הקרנה ברגל (ראה דוגמא). \nלאחר תיקון הסטייה ניתן לעבור לתרגיל הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה. \n\n* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. \nברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");

                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/E8VEy7eA6iU";
                            tvR.setText("התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם היד על המותן הבולטת יותר הצידה ולדחוף את האגן הצידה לשם  תיקון סטיית הגוף וחזרה, מבלי להפיק כאב/הקרנה ברגל (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב ועדיף להשאר סטטי כ- 3-5 שניות בסוף הטווח. חשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום. \nלאחר תיקון הסטייה ניתן לעבור לתרגיל הבא.");

                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/6E16Nqtekos";
                            tvR.setText("התקדמות העומסים " +
                                    "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                    "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                    "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                            break;
                        default:
                            link = "https://www.youtube.com/embed/0SianznASOc";
                            tvR.setText(" ");
                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                        case 26:
                            switch (levelSeek) {

                                case 0:
                                    link = "https://www.youtube.com/embed/E8VEy7eA6iU";
                                    tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה.  \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק.  \n \nפתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על העלמת הכאב (למרות שלרוב יהיה שילוב של השניים).  \n \nתרגול- בעמידה עם היד על המותן הבולטת יותר הצידה ולדחוף את האגן הצידה בטווח קטן יחסית לשם תיקון סטיית הגוף ולהישאר בסוף הטווח כ- 3-5 שניות לשם הגברת אפקט התרגיל, מבלי להפיק כאב/הקרנה ברגל (ראה דוגמא).  \nלאחר תיקון הסטייה ניתן לעבור לתרגיל הבא.  \n \n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם.  \n \n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל.  \n \n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה.  \n \n* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה.  \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");


                                    break;
                                case 1:
                                    link = "https://www.youtube.com/embed/6E16Nqtekos";
                                    tvR.setText("התקדמות העומסים " +
                                            "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                                    break;
                                case 2:
                                    link = "https://www.youtube.com/embed/6ggpXZzkXM0";
                                    tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה והברכיים כפופות (כפות הרגליים על המיטה). נא לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                                    break;
                                case 3:
                                    link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                                    tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                            "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                            "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                                    break;
                                default:
                                    link = "https://www.youtube.com/embed/tTTL4f_cBDg";

                            }
                            wbr.getSettings().setJavaScriptEnabled(true);
                            //  wbr.getSettings().setDisplayZoomControls(true);


                            wbr.loadUrl(link);


                            break;

                        case 27:
                            switch (levelSeek) {

                                case 0:
                                    link = "https://www.youtube.com/embed/7iNIJapYo24";
                                    tvR.setText("יש לנו איבחון, " +
                                            " הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק. פתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בעמידה עם הכתף אל הקיר (הצד הלא כאוב אל הקיר), רגליים צמודות ונמצאות במרחק כ- 30 ס\"מ מהקיר. יד נגדית נמצאת על המותן ודוחפת את האגן לכיוון הקיר (ראה דוגמא). \nלאחר תיקון הסטייה ניתן לעבור לתרגיל הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה. \n\n* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. בקיצור \nכאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");

                                    break;
                                case 1:
                                    link = "https://www.youtube.com/embed/6E16Nqtekos";
                                    tvR.setText("התקדמות העומסים " +
                                            "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                                    break;
                                case 2:
                                    link = "https://www.youtube.com/embed/6ggpXZzkXM0";
                                    tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה והברכיים כפופות (כפות הרגליים על המיטה). נא לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                                    break;
                                case 3:
                                    link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                                    tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                            "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                            "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                                    break;
                                default:
                                    link = "https://www.youtube.com/embed/0SianznASOc";
                                    tvR.setText(" ");


                            }
                            wbr.getSettings().setJavaScriptEnabled(true);
                            //  wbr.getSettings().setDisplayZoomControls(true);


                            wbr.loadUrl(link);

                            break;

                        case 28:
                            switch (levelSeek) {

                                case 0:
                                    link = "https://www.youtube.com/embed/UW1lBmj7Wrk";
                                    tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק. \n\nפתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בעמידה עם הכתף אל הקיר (הצד הלא כאוב אל הקיר), רגליים צמודות ונמצאות במרחק כ- 30 ס\"מ מהקיר. יד נגדית נמצאת על המותן ודוחפת את האגן לכיוון הקיר, אך בטווח קטן יחסית מבלי להפיק כאב/הקרנה לרגל (ראה דוגמא). \nלאחר שיפור בכאב/ בסטייה ניתן להתקדם לתרגיל " +

                                            "הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה. \n\n* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");

                                    break;
                                case 1:
                                    link = "https://www.youtube.com/embed/6NsiVzxD0jo";
                                    tvR.setText("התקדמות העומסים \n" +
                                            "על עמוד השדרה. \n\nבעמידה עם הכתף אל הקיר (הצד הלא כאוב אל הקיר), רגליים צמודות  ונמצאות במרחק כ- 30 ס\"מ מהקיר. \nיד נגדית נמצאת על המותן ודוחפת את האגן לכיוון הקיר, ולהישאר במנח הסופי סטטי 3-5 שניות להגברת אפקט התרגיל מבלי להפיק כאב/הקרנה לרגל (ראה דוגמא). \nלאחר שיפור בכאב/ בסטייה ניתן להתקדם לתרגיל הבא (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                                    break;
                                case 2:
                                    link = "https://www.youtube.com/embed/6E16Nqtekos";
                                    tvR.setText("התקדמות העומסים " +
                                            "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                                    break;
                                case 3:
                                    link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                                    tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                            "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                            "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                                    break;
                                default:
                                    link = "https://www.youtube.com/embed/KzQn1hOmOfY";

                            }
                            wbr.getSettings().setJavaScriptEnabled(true);
                            //  wbr.getSettings().setDisplayZoomControls(true);


                            wbr.loadUrl(link);

                            break;

                        case 29:
                            switch (levelSeek) {


                                case 0:
                                    link = "https://www.youtube.com/embed/DSE1ofZOhPM";
                                    tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק.\n\n" +
                                            "פתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בעמידה במפתן הדלת עם הידיים על המשקופים ולהביא את האגן הצידה לעבר כיוון תיקון הסטייה (ראה דוגמא). \nלאחר שיפור בכאב/ בסטייה ניתן להתקדם לתרגיל הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה.\n\n" +
                                            "* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");

                                    break;
                                case 1:
                                    link = "https://www.youtube.com/embed/6E16Nqtekos";
                                    tvR.setText("התקדמות העומסים " +
                                            "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                                    break;
                                case 2:
                                    link = "https://www.youtube.com/embed/6ggpXZzkXM0";
                                    tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה והברכיים כפופות (כפות הרגליים על המיטה). נא לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                                    break;
                                case 3:
                                    link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                                    tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                            "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                            "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                                    break;
                                default:
                                    link = "https://www.youtube.com/embed/0SianznASOc";
                                    tvR.setText(" ");


                            }
                            wbr.getSettings().setJavaScriptEnabled(true);
                            //  wbr.getSettings().setDisplayZoomControls(true);


                            wbr.loadUrl(link);

                            break;

                        case 30:
                            switch (levelSeek) {

                                case 0:
                                    link = "https://www.youtube.com/embed/Zc2mRSsjf7k";
                                    tvR.setText("יש לנו איבחון, הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק.\n\n" +
                                            "פתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בעמידה במפתן הדלת עם הידיים על המשקופים ולהביא את האגן הצידה לעבר כיוון תיקון הסטייה, ולהישאר סטטי בסוף טווח התנועה 3-5 שניות לשם הגברת אפקט התרגיל מבלי להפיק כאב/הקרנה ברגל (ראה דוגמא). \nלאחר שיפור בכאב/ בסטייה ניתן להתקדם לתרגיל הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה.\n\n" +
                                            "* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. \nבקיצור כאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");


                                    break;
                                case 1:
                                    link = "https://www.youtube.com/embed/6E16Nqtekos";
                                    tvR.setText("התקדמות העומסים " +
                                            "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                                    break;
                                case 2:
                                    link = "https://www.youtube.com/embed/6ggpXZzkXM0";
                                    tvR.setText(" התקדמות לתרגילי חיזוק. \n\nנא לשכב על הגב, ידיים מורמות כלפי התקרה והברכיים כפופות (כפות הרגליים על המיטה). נא לבצע הרמות אגן (תוך כדי שהבטן בפנים ומוציאים אויר) עם הוצאת האוויר בזמן הרמת האגן ולהישאר למעלה כ- 5-10 שניות (יש לשמור על אגן- ראה דוגמא). \nיש לבצע 10 חזרות, 2-3 סטים, פעם אחת ביום. \n\nכאשר מרגישים שהתרגיל כבר יותר קל, יש לעבור לתרגיל הבא.");

                                    break;
                                case 3:
                                    link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                                    tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                            "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                            "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                                    break;
                                default:
                                    link = "https://www.youtube.com/embed/0SianznASOc";
                                    tvR.setText(" ");


                            }
                            wbr.getSettings().setJavaScriptEnabled(true);
                            //  wbr.getSettings().setDisplayZoomControls(true);


                            wbr.loadUrl(link);

                            break;

                        case 31:
                            switch (levelSeek) {


                                case 0:
                                    link = "https://www.youtube.com/embed/HuOYzp4Yt3I";
                                    tvR.setText("יש לנו איבחון " +
                                            ", הכאבים שלך נובעים כנראה מהפרעה תוך מפרקית הגורמת לשינוי במנח המפרקי הנורמאלי במנוחה. \nההפרעה התוך מפרקית הזו גורמת לסטייה של המחלק העליון של הגוו (כתפיים) לעומת האגן ומגבילה את תנועת המפרק. \n\nפתרון- חובה לתקן את הסטייה באמצעות תרגילים מתאימים לפני שמתחילים לחשוב על העלמת הכאב (למרות שלרוב יהיה שילוב של השניים). \n\nתרגול- בעמידה במפתן הדלת עם הידיים על המשקופים ולהביא את האגן הצידה לעבר כיוון תיקון הסטייה, אך בטווח קטן יחסית מבלי להפיק כאב/הקרנה ברגל (ראה דוגמא). \nלאחר שיפור בכאב/ בסטייה ניתן להתקדם לתרגיל הבא. \n\n* חשוב לבצע את התנועה בכל 2-3 שעות, 10-15 חזרות בכל פעם. \n\n* כאשר בתחילת התרגיל מרגישים כאב/הקרנה אל הרגל/ לישבן, חשוב להרגיש שהכאב עובר לכיוון מרכז עמוד השדרה ולא מתרחק יותר אל הרגל. \n\n* אמצעי זהירות- לבצע את החזרות הראשוניות בעדינות ובאחרונות לנסות להגיע לסוף טווח התנועה. \n\n* טיפ לטווח הארוך- הגוף שלנו מצליח לעשות פיצויים מסוימים על מנת להמשיך את התפקוד, עוד לפני שמתחיל כאב כלשהו. ברגע שמתחיל כאב, זה אומר שהבעיה התחילה הרבה לפני זה. קיצור רקמות וכאב לאורך זמן במקום מסוים בגוף יכול לגרום לנזקים נוספים אם אינו מטופל כמה שיותר מהר.");

                                    break;
                                case 1:
                                    link = "https://www.youtube.com/embed/Zc2mRSsjf7k";
                                    tvR.setText("התקדמות העומסים " +
                                            "על עמוד השדרה. \n\nבעמידה במפתן הדלת עם הידיים על המשקופים ולהביא את האגן הצידה  לעבר כיוון תיקון הסטייה (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב ולהישאר סטטי בסוף הטווח 3-5 שניות לשם הגברת אפקט " +
                                            "התרגיל, מבלי להפיק כאב/הקרנה ברגל. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום. \nלאחר שיפור בכאב/ בסטייה ניתן להתקדם לתרגיל הבא.");

                                    break;
                                case 2:
                                    link = "https://www.youtube.com/embed/6E16Nqtekos";
                                    tvR.setText("התקדמות העומסים " +
                                            "על עמוד השדרה. \n\nבעמידה עם רגליים מונחות ברוחב אגן, להניח את כפות הידיים על אזור הגב התחתון ולהקשית את הגב לאחור תוך כדי שמירה על ברכיים ישרות (ראה דוגמא). \nיש לבצע את התרגיל בטווח תנועה המתקדם לטווח המירבי עד הרגשת מתיחה/כאב. \n\nחשוב לבצע את התרגיל 10-15 חזרות, בכל 3 שעות במהלך היום.");

                                    break;
                                case 3:
                                    link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                                    tvR.setText(" התקדמות בתרגילי החיזוק. \n\nבעמידת 6 על המיטה, גב במצב ניטרלי. \nנא להרים יד אחת " +
                                            "לפנים ורגל נגדית ישרה באוויר לאחור (תוך כדי שהבטן בפנים כל הזמן) ולהישאר סטטיים כ- " +
                                            "10-15 שניות (יש לשמור על אגן יציב למרות הרמת הרגל והיד- ראה דוגמא). \nיש לבצע 10 חזרות בכל צד, 2-3 סטים, פעם אחת ביום.");

                                    break;
                                default:
                                    link = "https://www.youtube.com/embed/KzQn1hOmOfY";
                                    tvR.setText(" ");


                            }


                            wbr.getSettings().setJavaScriptEnabled(true);
                            //  wbr.getSettings().setDisplayZoomControls(true);


                            wbr.loadUrl(link);


                    break;
                case 1000:

                    btnNextResult.setText("תרגיל נוסף");
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/1RFrLHa5id8";
                            tvR.setText("תיקון לישיבה נכונה להורדת עומסים מהצוואר - \nלשבת במצב כפוף (צוואר וגב תחתון) ואז " +
                                    "לבצע מקסימום תיקון ליישור הגב והצוואר ולשחרר 10% מהמנח המוגזם. \nלהישאר במנח " +
                                    "זה כ- 10 שניות ולשחרר שוב לכיפוף (ראה דוגמא). \n\nלבצע 10 חזרות, בכל פעם להחזיק למשך 10 שניות, פעמיים ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/R76k95lBrxQ";
                            tvR.setText("תיקון מנח צווארי לא נכון- \nלשבת על כיסא עם גב ישר, לבצע הכנסת סנטר עד הרגשת " +
                                    "מתח/כאב באזור התחתון של הצוואר או חלק עליון של הגב (ראה דוגמא). \nלבצע 10 חזרות, 5-6 פעמים ביום.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/HsNMajekN9A";
                            tvR.setText("תיקון מנח צווארי לא נכון, מתקדם- \nלשבת על כיסא עם גב ישר, לבצע הכנסת סנטר עד " +
                                    "לסוף הטווח שניתן ובסוף להוסיף תנועת פשיטת ראש לאחור עם פה פתוח, מבלי לאבד " +
                                    "מהתנועה ההתחלתית (ראה דוגמא). \nלבצע 10 חזרות , 5-6 פעמים ביום.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/iR41xkOrLq0";
                            tvR.setText("תיקון סופי של כאבי צוואר- \nלשבת על כיסא עם גב ישר, לבצע הכנסת סנטר עד לסוף " +
                                    "הטווח שניתן, להוסיף תנועת פשיטת ראש לאחור עם פה פתוח, מבלי לאבד מהתנועה " +
                                    "ההתחלתית ובסוף של הפשיטה להוסיף תנועות קטנות של רוטציה מצד לצד (ראה דוגמא). \nלבצע 10 חזרות, 5-6 פעמים ביום. ");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/iR41xkOrLq0";
                            tvR.setText("");

                    }


                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 2000:
                    btnNextResult.setText("תרגיל נוסף");
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/-VestJc21Vs";
                            tvR.setText("חיזוק שרירי מרחיקי השכמות בשכיבה- בשכיבה על הגב וידיים לכיוון התקרה.\n לבצע " +
                                    "הרחקה של השכמות אחת מהשנייה תוך כדי הרמת הידיים לכיוון התקרה, מבלי ביצוע " +
                                    "תנועות נלוות של הראש או בית החזה (ראה דוגמא). \nניתן להוסיף מקל בידיים אם קל מידי." +
                                    "לבצע 10 חזרות, 2-3 סטים ( מנוחה 30-60 שניות בין הסטים ), פעמיים ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/RA6WOKEQKHQ";
                            tvR.setText("שיפור טווח תנועת כיפוף בכתף- בעמידה מול קיר, הנעת היד על הקיר בעזרת טיפוס עם " +
                                    "האצבעות.\n להגיע לקצה טווח התנועה או עד הרגשת כאב/מתיחה (ראה דוגמא).\n לבצע 10 " +
                                    "חזרות 2-3 סטים ( מנוחה 30-60 שניות בין הסטים ), פעמיים ביום. ");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/zF91ADSzNII";
                            tvR.setText("חיזוק מרחיקי שכמות ונשיאת משקל על הכתפיים- בעמידת 6, הישענות על כפות הידיים " +
                                    "או על האגרופים (לפי נוחות),\n לבצע הרחקה בין השכמות ולנסות שלא יתבצעו תנועות " +
                                    "נוספות באזור הראש/בית החזה/עמוד השדרה.\n לבצע 10 חזרות 2-3 סטים ( מנוחה 30-60 שניות בין הסטים ), פעם אחת ביום ");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/Du14LPwuGtk";
                            tvR.setText("נשיאת משקל מתקדמת על הכתפיים- בעמידת 4 או עמידת 6 על הרצפה, מרפקים " +
                                    "פתוחים לצדדים או ליד הגוף (לפי יכולת).\n ביצוע שכיבות שמיכה עד למגע עם הרצפה או עד " +
                                    "נקודת כאב/עומס בשורש כף היד (אם קשה מידי מבחינת הטווח בשורש כף היד, ניתן לנסות\n" +
                                    "לבצע על אגרופים).\n לבצע 10 חזרות 2-3 סטים ( מנוחה 30-60 שניות בין הסטים ), פעם אחת ביום ");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/-VestJc21Vs";
                            tvR.setText("");

                    }


                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 3000:
                    btnNextResult.setText("תרגיל נוסף");
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/1RFrLHa5id8";
                            tvR.setText("תיקון לישיבה נכונה להורדת עומסים מהצוואר/גב עליון/גב תחתון- לשבת במצב כפוף " +
                                    "(צוואר וגב תחתון)\n ואז לבצע מקסימום תיקון ליישור הגב והצוואר ולשחרר 10% מהמנח " +
                                    "המוגזם.\n להישאר במנח זה כ- 10 שניות ולשחרר שוב לכיפוף (ראה דוגמא).\n " +
                                    "לבצע 10 חזרות 2-3 סטים ( מנוחה 30-60 שניות בין הסטים ), 5-6 פעמים ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/R76k95lBrxQ";
                            tvR.setText("הגמשת צוואר תחתון/גב עליון- לשבת על כיסא עם גב ישר, לבצע הכנסת סנטר עד " +
                                    "הרגשת מתח/כאב באזור התחתון של הצוואר או חלק עליון של הגב (ראה דוגמא). \n" +
                                    "לבצע 10 חזרות 2-3 סטים ( מנוחה 30-60 שניות בין הסטים ), 5-6 פעמים ביום.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/5brCfMDk_d0";
                            tvR.setText("שיפור גמישות הגב העליון והתחתון- בשכיבה על הבטן, להביא את הידיים לפנים ולבצע\n" +
                                    "עליות למעלה של פלג הגוף העליון. להדגשת הגב העליון, יש לקחת את הידיים יותר לפנים\n" +
                                    "ולא מתחת לכתפיים. לבצע 10 חזרות, 5-6 פעמים ביום.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText("חיזוק שרירים מייצבים של מרכז הגוף- בעמידת 6, ביצוע הרמת רגל ויד נגדית. להחזיק " +
                                    "בתוך המנח הסופי כ- 10 שניות ולשחרר.\n לבצע בכל צד 10 חזרות להחזיק בכל חזרה 10 שניות במצב סטטי, " +
                                    "פעם ביום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/1RFrLHa5id8";
                            tvR.setText("");

                    }


                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 4000:
                    btnNextResult.setText("תרגיל נוסף");
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/31GCNKzst9A";
                            tvR.setText("מתיחת שרירי פושטי שורש כף היד- בעמידה/בישיבה,\n היד הכואבת מושטת ישרה לפנים " +
                                    "והיד הלא כואבת מחזיקה בגב כף היד הכואבת ומושכת אותה למטה עד להרגשת מתיחה " +
                                    "(ראה דוגמא).\n לבצע את המתיחה במשך 20-30 שניות, 2-3 חזרות.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/eHHBw8wNVww";
                            tvR.setText("חיזוק תוך כדי מתיחה לשרירי פושטי " +
                                    "שורש כף היד (eccentric). היד הלא כואבת מונחת על אזור גב כף היד של היד הכואבת " +
                                    "ומפעילה לחץ על היד הכואבת תוך כדי התנגדות מסוימת של היד הכואבת.\n בסוף הטווח," +
                                    "היד הלא כואבת מחזירה את היד הכואבת אל המנח ההתחלתי של התרגיל וחוזר חלילה " +
                                    "(ראה דוגמא).\n לבצע 10 חזרות בכל סט , 3 סטים ( 30-60 שניות מנוחה בין הסטים ), לחזור על התרגול 2-3 פעמים ביום.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/UwAjli9KCBA";
                            tvR.setText("תרגול נשיאת משקל על כפות הידיים לחיזוק שרירים- בעמידה של כ- 60-50 ס\"מ מהקיר,\n" +
                                    "ידיים מונחות על הקיר וביצוע שכיבות שמיכה עד לקיר או עד נקודת הכאב (ראה דוגמא).\n" +
                                    "לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), פעם אחת ביום.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/Du14LPwuGtk";
                            tvR.setText("תרגול מתקדם של נשיאת משקל על כפות הידיים לחיזוק שרירים-\n בעמידת 4 או עמידת " +
                                    "6 על הרצפה, מרפקים פתוחים לצדדים או ליד הגוף (לפי יכולת).\n ביצוע שכיבות שמיכה עד " +
                                    "למגע עם הרצפה או עד נקודת כאב/עומס בשורש כף היד (אם קשה מידי מבחינת הטווח " +
                                    "בשורש כף היד, ניתן לנסות לבצע על אגרופים).\n לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), פעם אחת ביום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/31GCNKzst9A";
                            tvR.setText("");

                    }


                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 6000:
                    btnNextResult.setText("תרגיל נוסף");
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/7qR102-o6Ug";
                            tvR.setText("מתיחת כופפי ירך- בעמידה, \nלפני שמתחילים יש להביא אגן לפנים, ולכווץ את הבטן כדי שלא תהיה הקשתה של הגב \n להניח את הרגל הלא כאובה על כיסא או מיטה נמוכה.\n" +
                                    "לשמור על גב ישר ולהניע את כל הגוף לפנים עד הרגשת מתיחה באזור המפשעה של " +
                                    "הרגל שעל הרצפה.\n יש לשמור על כף הרגל שעל הרצפה שהאצבעות יהיו לכיוון לפנים " +
                                    "או אפילו בסיבוב פנימי.\n עדיף לבצע לשתי הרגליים.\n " +
                                    "לבצע 10 חזרות , להחזיק 10 שניות בכל חזרה, 2-3 פעמים ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/atR-K64dVHo";
                            tvR.setText("חיזוק מרחיקי ירך בשכיבה- בשכיבה על הצד הלא כאוב,\n להרים את הרגל הכאובה ישר " +
                                    "לכיוון התקרה כאשר העקב מוביל תנועה (אצבעות פונות לפנים ולא לכיוון התקרה).\n" +
                                    "חשוב לשמור על רגל ישרה והמשכית לגוף (ואפילו ניתן להביא את הרגל קצת לאחור " +
                                    "בזמן ההרמה). \nעדיף לבצע לשתי הרגליים.\n לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), פעם אחת ביום.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/vG8kS5-B68Q";
                            tvR.setText("חיזוק שריר הישבן בשכיבה –\n בשכיבה על הגב, ברכיים כפופות עם כפות הרגליים על " +
                                    "המיטה. \nליישר רגל אחת ולהרים אגן תוך כדי שמירה על אגן יציב.\nעדיף לבצע לשתי " +
                                    "הרגליים ולהישאר למעלה כ- 3-5 שניות.\nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), פעם אחת ביום.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/l39dRamwlyw";
                            tvR.setText(" .חיזוק מרחיקי ירך בעמידה-\n בעמידה על הרגל הלא כאובה לבצע הרחקת ירך הצידה " +
                                    "עד כ- 45 מעלות מבלי לבצע תנועות נלוות בשאר הגוף (גב ישר).\n אם קשה לשמור על " +
                                    "שיווי משקל על רגל אחת, ניתן להניח יד עד קיר או משענת של כיסא.\n עדיף לבצע לשתי " +
                                    "הרגליים.\n לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), פעם אחת ביום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/7qR102-o6Ug";
                            tvR.setText(" ");

                    }



                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;
                case 7000:
                    btnNextResult.setText("תרגיל נוסף");
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/RFT-e8MPUqw";
                            tvR.setText("שיפור תנועת פשיטה בשורש כף היד- \nבעמידה ליד שולחן, כף היד הלא כואבת מונחת " +
                                    "מעל לגב כף היד הכואבת (ללא מגע בשורש כף היד). \nביצוע תנועה פסיבית של פשיטה " +
                                    "בשורש כף היד בעזרת תנועת הגוף עד הרגשת מתיחה/כאב, כאשר היד הלא כואבת " +
                                    "מצמידה את כף היד לשולחן (ראה דוגמא). \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), 2-3 פעמים ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/31GCNKzst9A";
                            tvR.setText("מתיחת שרירי פושטי שורש כף היד-\n בעמידה/בישיבה, היד הכואבת מושטת ישרה לפנים " +
                                    "והיד הלא כואבת מחזיקה בגב כף היד הכואבת (ללא מגע בשורש כף היד) ומושכת אותה למטה עד להרגשת מתיחה " +
                                    "(ראה דוגמא). \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), 2-3 פעמים ביום.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/UwAjli9KCBA";
                            tvR.setText("תרגול נשיאת משקל על כפות הידיים לחיזוק שרירים- בעמידה של כ- 60-50 ס\"מ מהקיר,\n" +
                                    "ידיים מונחות על הקיר וביצוע שכיבות שמיכה עד לקיר או עד נקודת הכאב (ראה דוגמא).\n" +
                                    "לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם אחת ביום. ");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/Du14LPwuGtk";
                            tvR.setText("תרגול מתקדם של נשיאת משקל על כפות הידיים לחיזוק שרירים-\n בעמידת 4 או עמידת " +
                                    "6 על הרצפה, מרפקים פתוחים לצדדים או ליד הגוף (לפי יכולת). \nביצוע שכיבות שמיכה עד " +
                                    "למגע עם הרצפה או עד נקודת כאב/עומס בשורש כף היד (אם קשה מידי מבחינת הטווח " +
                                    "בשורש כף היד, ניתן לנסות לבצע על אגרופים). \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם אחת ביום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/RFT-e8MPUqw";
                            tvR.setText("");

                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);
                    break;



                case 8000:
                    btnNextResult.setText("תרגיל נוסף");
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/ftSI_xpNA5c";
                            tvR.setText("חיזוק שריר הירך הקדמי בשכיבה-\n בשכיבה על הגב, רגל אחת ישרה ושניה כפופה על " +
                                    "המיטה.\n להרים רגל ישרה עד לגובה של הרגל השנייה. לשמור על ברך ישרה לאורך כל " +
                                    "התנועה למעלה וחזרה למטה.\nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם אחת ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/OmC7GmEfz_I";
                            tvR.setText("חיזוק שרירי רגליים בעמידה- \nבעמידה עם הישענות הגב על קיר/דלת, רגליים כ- - 40 " +
                                    "30 ס\"מ מהקיר ברוחב אגן (או קצת יותר). \nלבצע כיפוף של הברכיים כ- 45 מעלות " +
                                    "וחזרה למעלה (סקוואט). \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם אחת ביום.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/vG8kS5-B68Q";
                            tvR.setText("חיזוק שריר הישבן והירך האחורית בשכיבה –\nבשכיבה על הגב, ברכיים כפופות עם " +
                                    "כפות הרגליים על המיטה. \nליישר רגל אחת ולהרים אגן תוך כדי שמירה על אגן יציב." +
                                    "עדיף לבצע לשתי הרגליים ולהישאר למעלה כ- 5-3 שניות. \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם אחת ביום."
                            );
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/8H3TY9h18_0";
                            tvR.setText("חיזוק שרירי רגליים בעמידה על רגל אחת- \nלכופף את הברך כ- " +
                                    "45 מעלות תוך כדי לקיחת הישבן לאחור (כאילו מתיישבים על כסא)  ולעלות חזרה למעלה עד כמעט יישור שך הברך.\nלנסות להישאר על רגל " +
                                    "אחת במהלך כל הסט, עדיף לבצע את התרגיל לשתי הרגליים.\nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם אחת ביום."
                            );
                            break;
                        default:
                            link = "https://www.youtube.com/embed/ftSI_xpNA5c";
                            tvR.setText("");

                    }

                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;



                case 9000:
                    btnNextResult.setText("תרגיל נוסף");
                    switch (levelSeek) {

                        case 3:
                            link = "https://www.youtube.com/embed/8H3TY9h18_0";
                            tvR.setText("חיזוק שרירי רגליים בעמידה על רגל אחת- \nבעמידה על רגל אחת, לכופף את הברך כ- " +
                                    "45 מעלות ולעלות חזרה למעלה עד כמעט יישור של הברך (סקוואט). \nלנסות להישאר " +
                                    "על רגל אחת במהלך כל הסט, עדיף לבצע את התרגיל לשתי הרגליים.\n" +
                                    "לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם ביום.");
                            break;
                        case 0:
                            link = "https://www.youtube.com/embed/JgrPKXlFa2g";
                            tvR.setText("מתיחת שרירי הסובך בעמידה- \nבעמידה מול קיר עם רגל אחת אחורה ואחת לפנים.\n" +
                                    "ידיים על הקיר ולהישען לפנים תוך כדי שמירת רגל אחורית עם ברך ישרה ועקב צמוד " +
                                    "לרצפה. \nלבצע עד הרגשת מתיחה בשריר השוק האחורי של הרגל האחורית ולהישאר " +
                                    "במנח כ- 5-10 שניות. \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),2-3 פעמים ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/vG8kS5-B68Q";
                            tvR.setText("חיזוק הדרגתי של שרירי קרסול בשכיבה –\nבשכיבה על הגב, ברכיים כפופות עם " +
                                    "כפות הרגליים על המיטה. \nליישר רגל אחת ולהרים אגן תוך כדי שמירה על אגן יציב. " +
                                    "עדיף לבצע לשתי הרגליים ולהישאר למעלה כ- 5-3 שניות. \nניתן לקחת את הרגל " +
                                    "שעומדים עליה יותר קדימה לשם התקדמות בתרגול. \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם ביום."
                            );
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/l39dRamwlyw";
                            tvR.setText("שמירת שיווי משקל על רגל אחת- \nבעמידה על הרגל הבעייתית, לבצע הרחקת ירך " +
                                    "הצידה מבלי לבצע תנועות נלוות בשאר הגוף (גב ישר). \nהעדיפות היא להשאיר באוויר " +
                                    "את הרגל שמבצעת הרחקה במהלך כל הסט. \nעדיף לבצע לשתי הרגליים.\n" +
                                    "לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם ביום.");
                            break;
                        default:
                            link = "";
                            tvR.setText("");

                    }

                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;
                default:{

                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/1RFrLHa5id8";
                            tvR.setText("");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/R76k95lBrxQ";
                            tvR.setText("");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/HsNMajekN9A";
                            tvR.setText("");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/iR41xkOrLq0";
                            tvR.setText("");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/iR41xkOrLq0";
                            tvR.setText("");

                    }

                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);


                }
          //  }} else{

         /*   switch (iArea) {

                case 1000:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/1RFrLHa5id8";
                            tvR.setText("תיקון לישיבה נכונה להורדת עומסים מהצוואר - לשבת במצב כפוף (צוואר וגב תחתון) ואז\n" +
                                    "לבצע מקסימום תיקון ליישור הגב והצוואר ולשחרר 10% מהמנח המוגזם. להישאר במנח\n" +
                                    "זה כ- 10 שניות ולשחרר שוב לכיפוף (ראה דוגמא). לבצע 10 חזרות, בכל פעם להחזיק למשך 10 שניות, פעמיים ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/R76k95lBrxQ";
                            tvR.setText("תיקון מנח צווארי לא נכון- לשבת על כיסא עם גב ישר, לבצע הכנסת סנטר עד הרגשת\n" +
                                    "מתח/כאב באזור התחתון של הצוואר או חלק עליון של הגב (ראה דוגמא). לבצע 10 חזרות, 5-6 פעמים ביום.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/HsNMajekN9A";
                            tvR.setText("תיקון מנח צווארי לא נכון, מתקדם- לשבת על כיסא עם גב ישר, לבצע הכנסת סנטר עד\n" +
                                    "לסוף הטווח שניתן ובסוף להוסיף תנועת פשיטת ראש לאחור עם פה פתוח, מבלי לאבד\n" +
                                    "מהתנועה ההתחלתית (ראה דוגמא). לבצע 10 חזרות , 5-6 פעמים ביום.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/iR41xkOrLq0";
                            tvR.setText("תיקון סופי של כאבי צוואר- לשבת על כיסא עם גב ישר, לבצע הכנסת סנטר עד לסוף\n" +
                                    "הטווח שניתן, להוסיף תנועת פשיטת ראש לאחור עם פה פתוח, מבלי לאבד מהתנועה\n" +
                                    "ההתחלתית ובסוף של הפשיטה להוסיף תנועות קטנות של רוטציה מצד לצד (ראה דוגמא). לבצע 10 חזרות, 5-6 פעמים ביום. ");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/iR41xkOrLq0";
                            tvR.setText("");

                    }


                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 2000:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/-VestJc21Vs";
                            tvR.setText("חיזוק שרירי מרחיקי השכמות בשכיבה- בשכיבה על הגב וידיים לכיוון התקרה.\n לבצע" +
                                    "הרחקה של השכמות אחת מהשנייה תוך כדי הרמת הידיים לכיוון התקרה, מבלי ביצוע\n" +
                                    "תנועות נלוות של הראש או בית החזה (ראה דוגמא). ניתן להוסיף מקל בידיים אם קל מידי.\n" +
                                    "לבצע 10 חזרות, 2-3 סטים ( מנוחה 30-60 שניות בין הסטים ), פעמיים ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/RA6WOKEQKHQ";
                            tvR.setText("שיפור טווח תנועת כיפוף בכתף- בעמידה מול קיר, הנעת היד על הקיר בעזרת טיפוס עם" +
                                    "האצבעות.\n להגיע לקצה טווח התנועה או עד הרגשת כאב/מתיחה (ראה דוגמא).\n לבצע 10" +
                                    "חזרות 2-3 סטים ( מנוחה 30-60 שניות בין הסטים ), פעמיים ביום. ");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/zF91ADSzNII";
                            tvR.setText("חיזוק מרחיקי שכמות ונשיאת משקל על הכתפיים- בעמידת 6, הישענות על כפות הידיים" +
                                    "או על האגרופים (לפי נוחות),\n לבצע הרחקה בין השכמות ולנסות שלא יתבצעו תנועות" +
                                    "נוספות באזור הראש/בית החזה/עמוד השדרה.\n לבצע 10 חזרות 2-3 סטים ( מנוחה 30-60 שניות בין הסטים ), פעם אחת ביום");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/Du14LPwuGtk";
                            tvR.setText("נשיאת משקל מתקדמת על הכתפיים- בעמידת 4 או עמידת 6 על הרצפה, מרפקים" +
                                    "פתוחים לצדדים או ליד הגוף (לפי יכולת).\n ביצוע שכיבות שמיכה עד למגע עם הרצפה או עד" +
                                    "נקודת כאב/עומס בשורש כף היד (אם קשה מידי מבחינת הטווח בשורש כף היד, ניתן לנסות\n" +
                                    "לבצע על אגרופים).\n לבצע 10 חזרות 2-3 סטים ( מנוחה 30-60 שניות בין הסטים ), פעם אחת ביום");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/-VestJc21Vs";
                            tvR.setText("");

                    }


                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 3000:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/1RFrLHa5id8";
                            tvR.setText("תיקון לישיבה נכונה להורדת עומסים מהצוואר/גב עליון/גב תחתון- לשבת במצב כפוף" +
                                    "(צוואר וגב תחתון)\n ואז לבצע מקסימום תיקון ליישור הגב והצוואר ולשחרר 10% מהמנח" +
                                    "המוגזם.\n להישאר במנח זה כ- 10 שניות ולשחרר שוב לכיפוף (ראה דוגמא).\n " +
                                    "לבצע 10 חזרות 2-3 סטים ( מנוחה 30-60 שניות בין הסטים ), 5-6 פעמים ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/R76k95lBrxQ";
                            tvR.setText("הגמשת צוואר תחתון/גב עליון- לשבת על כיסא עם גב ישר, לבצע הכנסת סנטר עד" +
                                    "הרגשת מתח/כאב באזור התחתון של הצוואר או חלק עליון של הגב (ראה דוגמא). \n" +
                                    "לבצע 10 חזרות 2-3 סטים ( מנוחה 30-60 שניות בין הסטים ), 5-6 פעמים ביום.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/5brCfMDk_d0";
                            tvR.setText("שיפור גמישות הגב העליון והתחתון- בשכיבה על הבטן, להביא את הידיים לפנים ולבצע\n" +
                                    "עליות למעלה של פלג הגוף העליון. להדגשת הגב העליון, יש לקחת את הידיים יותר לפנים\n" +
                                    "ולא מתחת לכתפיים. לבצע 10 חזרות, 5-6 פעמים ביום.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/tTTL4f_cBDg";
                            tvR.setText("חיזוק שרירים מייצבים של מרכז הגוף- בעמידת 6, ביצוע הרמת רגל ויד נגדית. להחזיק" +
                                    "בתוך המנח הסופי כ- 10 שניות ולשחרר.\n לבצע בכל צד 10 חזרות להחזיק בכל חזרה 10 שניות במצב סטטי, " +
                                    "פעם ביום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/1RFrLHa5id8";
                            tvR.setText("");

                    }


                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 4000:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/31GCNKzst9A";
                            tvR.setText("מתיחת שרירי פושטי שורש כף היד- בעמידה/בישיבה,\n היד הכואבת מושטת ישרה לפנים" +
                                    "והיד הלא כואבת מחזיקה בגב כף היד הכואבת ומושכת אותה למטה עד להרגשת מתיחה" +
                                    "(ראה דוגמא).\n לבצע את המתיחה במשך 20-30 שניות, 2-3 חזרות.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/eHHBw8wNVww";
                            tvR.setText("חיזוק תוך כדי מתיחה לשרירי פושטי" +
                                    "שורש כף היד (eccentric). היד הלא כואבת מונחת על אזור גב כף היד של היד הכואבת" +
                                    "ומפעילה לחץ על היד הכואבת תוך כדי התנגדות מסוימת של היד הכואבת.\n בסוף הטווח," +
                                    "היד הלא כואבת מחזירה את היד הכואבת אל המנח ההתחלתי של התרגיל וחוזר חלילה" +
                                    "(ראה דוגמא).\n לבצע 10 חזרות בכל סט , 3 סטים ( 30-60 שניות מנוחה בין הסטים ), לחזור על התרגול 2-3 פעמים ביום.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/UwAjli9KCBA";
                            tvR.setText("תרגול נשיאת משקל על כפות הידיים לחיזוק שרירים- בעמידה של כ- 60-50 ס\"מ מהקיר,\n" +
                                    "ידיים מונחות על הקיר וביצוע שכיבות שמיכה עד לקיר או עד נקודת הכאב (ראה דוגמא).\n" +
                                    "לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), פעם אחת ביום.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/Du14LPwuGtk";
                            tvR.setText("תרגול מתקדם של נשיאת משקל על כפות הידיים לחיזוק שרירים-\n בעמידת 4 או עמידת" +
                                    "6 על הרצפה, מרפקים פתוחים לצדדים או ליד הגוף (לפי יכולת).\n ביצוע שכיבות שמיכה עד " +
                                    "למגע עם הרצפה או עד נקודת כאב/עומס בשורש כף היד (אם קשה מידי מבחינת הטווח" +
                                    "בשורש כף היד, ניתן לנסות לבצע על אגרופים).\n לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), פעם אחת ביום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/31GCNKzst9A";
                            tvR.setText("");

                    }


                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;

                case 6000:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/7qR102-o6Ug";
                            tvR.setText("מתיחת כופפי ירך- בעמידה, \nלפני שמתחילים יש להביא אגן לפנים, ולכווץ את הבטן כדי שלא תהיה הקשתה של הגב \n להניח את הרגל הלא כאובה על כיסא או מיטה נמוכה.\n" +
                                    "לשמור על גב ישר ולהניע את כל הגוף לפנים עד הרגשת מתיחה באזור המפשעה של" +
                                    "הרגל שעל הרצפה.\n יש לשמור על כף הרגל שעל הרצפה שהאצבעות יהיו לכיוון לפנים" +
                                    "או אפילו בסיבוב פנימי.\n עדיף לבצע לשתי הרגליים.\n " +
                                    "לבצע 10 חזרות , להחזיק 10 שניות בכל חזרה, 2-3 פעמים ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/atR-K64dVHo";
                            tvR.setText("חיזוק מרחיקי ירך בשכיבה- בשכיבה על הצד הלא כאוב,\n להרים את הרגל הכאובה ישר" +
                                    "לכיוון התקרה כאשר העקב מוביל תנועה (אצבעות פונות לפנים ולא לכיוון התקרה).\n" +
                                    "חשוב לשמור על רגל ישרה והמשכית לגוף (ואפילו ניתן להביא את הרגל קצת לאחור" +
                                    "בזמן ההרמה). \nעדיף לבצע לשתי הרגליים.\n לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), פעם אחת ביום.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/vG8kS5-B68Q";
                            tvR.setText("חיזוק שריר הישבן בשכיבה –\n בשכיבה על הגב, ברכיים כפופות עם כפות הרגליים על" +
                                    "המיטה. \nליישר רגל אחת ולהרים אגן תוך כדי שמירה על אגן יציב.\nעדיף לבצע לשתי" +
                                    "הרגליים ולהישאר למעלה כ- 3-5 שניות.\nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), פעם אחת ביום.");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/l39dRamwlyw";
                            tvR.setText(" .חיזוק מרחיקי ירך בעמידה-\n בעמידה על הרגל הלא כאובה לבצע הרחקת ירך הצידה" +
                                    "עד כ- 45 מעלות מבלי לבצע תנועות נלוות בשאר הגוף (גב ישר).\n אם קשה לשמור על" +
                                    "שיווי משקל על רגל אחת, ניתן להניח יד עד קיר או משענת של כיסא.\n עדיף לבצע לשתי" +
                                    "הרגליים.\n לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), פעם אחת ביום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/7qR102-o6Ug";
                            tvR.setText(" ");

                    }



                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;
                case 7000:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/RFT-e8MPUqw";
                            tvR.setText("שיפור תנועת פשיטה בשורש כף היד- \nבעמידה ליד שולחן, כף היד הלא כואבת מונחת" +
                                    "מעל לגב כף היד הכואבת (ללא מגע בשורש כף היד). \nביצוע תנועה פסיבית של פשיטה" +
                                    "בשורש כף היד בעזרת תנועת הגוף עד הרגשת מתיחה/כאב, כאשר היד הלא כואבת" +
                                    "מצמידה את כף היד לשולחן (ראה דוגמא). \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), 2-3 פעמים ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/31GCNKzst9A";
                            tvR.setText("מתיחת שרירי פושטי שורש כף היד-\n בעמידה/בישיבה, היד הכואבת מושטת ישרה לפנים" +
                                    "והיד הלא כואבת מחזיקה בגב כף היד הכואבת (ללא מגע בשורש כף היד) ומושכת אותה למטה עד להרגשת מתיחה" +
                                    "(ראה דוגמא). \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ), 2-3 פעמים ביום.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/UwAjli9KCBA";
                            tvR.setText("תרגול נשיאת משקל על כפות הידיים לחיזוק שרירים- בעמידה של כ- 60-50 ס\"מ מהקיר,\n" +
                                    "ידיים מונחות על הקיר וביצוע שכיבות שמיכה עד לקיר או עד נקודת הכאב (ראה דוגמא).\n" +
                                    "לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם אחת ביום. ");
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/Du14LPwuGtk";
                            tvR.setText("תרגול מתקדם של נשיאת משקל על כפות הידיים לחיזוק שרירים-\n בעמידת 4 או עמידת" +
                                    "6 על הרצפה, מרפקים פתוחים לצדדים או ליד הגוף (לפי יכולת). \nביצוע שכיבות שמיכה עד" +
                                    "למגע עם הרצפה או עד נקודת כאב/עומס בשורש כף היד (אם קשה מידי מבחינת הטווח" +
                                    "בשורש כף היד, ניתן לנסות לבצע על אגרופים). \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם אחת ביום.");
                            break;
                        default:
                            link = "https://www.youtube.com/embed/RFT-e8MPUqw";
                            tvR.setText("");

                    }
                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);
                    break;



                case 8000:
                    switch (levelSeek) {

                        case 0:
                            link = "https://www.youtube.com/embed/ftSI_xpNA5c";
                            tvR.setText("חיזוק שריר הירך הקדמי בשכיבה-\n בשכיבה על הגב, רגל אחת ישרה ושניה כפופה על" +
                                    "המיטה.\n להרים רגל ישרה עד לגובה של הרגל השנייה. לשמור על ברך ישרה לאורך כל" +
                                    "התנועה למעלה וחזרה למטה.\nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם אחת ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/OmC7GmEfz_I";
                            tvR.setText("חיזוק שרירי רגליים בעמידה- \nבעמידה עם הישענות הגב על קיר/דלת, רגליים כ- -40" +
                                    "30 ס\"מ מהקיר ברוחב אגן (או קצת יותר). \nלבצע כיפוף של הברכיים כ- 45 מעלות" +
                                    "וחזרה למעלה (סקוואט). \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם אחת ביום.");
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/vG8kS5-B68Q";
                            tvR.setText("חיזוק שריר הישבן והירך האחורית בשכיבה –\nבשכיבה על הגב, ברכיים כפופות עם" +
                                    "כפות הרגליים על המיטה. \nליישר רגל אחת ולהרים אגן תוך כדי שמירה על אגן יציב." +
                                    "עדיף לבצע לשתי הרגליים ולהישאר למעלה כ- 5-3 שניות. \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם אחת ביום."
                                    );
                            break;
                        case 3:
                            link = "https://www.youtube.com/embed/8H3TY9h18_0";
                            tvR.setText("חיזוק שרירי רגליים בעמידה על רגל אחת- \nלכופף את הברך כ-" +
                                    "45 מעלות תוך כדי לקיחת הישבן לאחור (כאילו מתיישבים על כסא)  ולעלות חזרה למעלה עד כמעט יישור שך הברך.\nלנסות להישאר על רגל" +
                                    "אחת במהלך כל הסט, עדיף לבצע את התרגיל לשתי הרגליים.\nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם אחת ביום." 
                                    );
                            break;
                        default:
                            link = "https://www.youtube.com/embed/ftSI_xpNA5c";
                            tvR.setText("");

                    }

                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;



                case 9000:
                    switch (levelSeek) {

                        case 3:
                            link = "https://www.youtube.com/embed/8H3TY9h18_0";
                            tvR.setText("חיזוק שרירי רגליים בעמידה על רגל אחת- \nבעמידה על רגל אחת, לכופף את הברך כ-" +
                                    "45 מעלות ולעלות חזרה למעלה עד כמעט יישור של הברך (סקוואט). \nלנסות להישאר" +
                                    "על רגל אחת במהלך כל הסט, עדיף לבצע את התרגיל לשתי הרגליים.\n" +
                                    "לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם ביום.");
                            break;
                        case 0:
                            link = "https://www.youtube.com/embed/JgrPKXlFa2g";
                            tvR.setText("מתיחת שרירי הסובך בעמידה- \nבעמידה מול קיר עם רגל אחת אחורה ואחת לפנים.\n" +
                                    "ידיים על הקיר ולהישען לפנים תוך כדי שמירת רגל אחורית עם ברך ישרה ועקב צמוד" +
                                    "לרצפה. \nלבצע עד הרגשת מתיחה בשריר השוק האחורי של הרגל האחורית ולהישאר" +
                                    "במנח כ- 5-10 שניות. \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),2-3 פעמים ביום.");
                            break;
                        case 1:
                            link = "https://www.youtube.com/embed/vG8kS5-B68Q";
                            tvR.setText("חיזוק הדרגתי של שרירי קרסול בשכיבה –\nבשכיבה על הגב, ברכיים כפופות עם" +
                                    "כפות הרגליים על המיטה. \nליישר רגל אחת ולהרים אגן תוך כדי שמירה על אגן יציב." +
                                    "עדיף לבצע לשתי הרגליים ולהישאר למעלה כ- 5-3 שניות. \nניתן לקחת את הרגל" +
                                    "שעומדים עליה יותר קדימה לשם התקדמות בתרגול. \nלבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם ביום."
                                    );
                            break;
                        case 2:
                            link = "https://www.youtube.com/embed/l39dRamwlyw";
                            tvR.setText("שמירת שיווי משקל על רגל אחת- \nבעמידה על הרגל הבעייתית, לבצע הרחקת ירך" +
                                    "הצידה מבלי לבצע תנועות נלוות בשאר הגוף (גב ישר). \nהעדיפות היא להשאיר באוויר" +
                                    "את הרגל שמבצעת הרחקה במהלך כל הסט. \nעדיף לבצע לשתי הרגליים.\n" +
                                    "לבצע 10 חזרות בכל סט , 2-3 סטים ( 30-60 שניות מנוחה בין הסטים ),פעם ביום.");
                            break;
                        default:
                            link = "";
                            tvR.setText("");

                    }

                    wbr.getSettings().setJavaScriptEnabled(true);
                    //  wbr.getSettings().setDisplayZoomControls(true);


                    wbr.loadUrl(link);

                    break;


                    default:{

                        switch (levelSeek) {

                            case 0:
                                link = "https://www.youtube.com/embed/1RFrLHa5id8";
                                tvR.setText("");
                                break;
                            case 1:
                                link = "https://www.youtube.com/embed/R76k95lBrxQ";
                                tvR.setText("");
                                break;
                            case 2:
                                link = "https://www.youtube.com/embed/HsNMajekN9A";
                                tvR.setText("");
                                break;
                            case 3:
                                link = "https://www.youtube.com/embed/iR41xkOrLq0";
                                tvR.setText("");
                                break;
                            default:
                                link = "https://www.youtube.com/embed/iR41xkOrLq0";
                                tvR.setText("");

                        }

                        wbr.getSettings().setJavaScriptEnabled(true);
                        //  wbr.getSettings().setDisplayZoomControls(true);


                        wbr.loadUrl(link);


                    }




            }*/
            }
        }









    private void initlayout() {

        tvR = (TextView) findViewById(R.id.tvTheResult);
        btnNextResult = (Button) findViewById(R.id.btnNextResult1);
        wbr = (WebView) findViewById(R.id.wvr);
        seek = (SeekBar) findViewById(R.id.seek);
        btnCancel = (Button) findViewById(R.id.btnCancel);


        theResultnow = getIntent().getStringExtra("result");


        stepTip = getIntent().getIntExtra("theR",0);

      //  iArea = getIntent().getIntExtra("myarea",0);




            prefs = getSharedPreferences("igal", MODE_PRIVATE);
            String total = prefs.getString("totalresult", null);
            levelSeek = prefs.getInt("level", 0);
            rt = prefs.getInt("t", 0);


            if (total != null) {
                theResult = total;//"No name defined" is the default value.
                stepTip = prefs.getInt("step", 0); //0 is the default value.


               // tvR.setText(theResult);
            }





invid();











    }









}
